app/controllers/students_controller.rb

INSERT INTO "students" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-04-18 19:43:59.318526"], ["updated_at", "2020-04-18 19:43:59.318526"]]
---
  def new
    @student = Student.new(first_name: params[:first_name], last_name: params[:last_name])
    @student.save

INSERT INTO "students" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-04-18 19:37:31.903002"], ["updated_at", "2020-04-18 19:37:31.903002"]]
---
  def create
    @student = Student.new(first_name: params[:first_name], last_name: params[:last_name])
    @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", nil], ["last_name", nil], ["updated_at", "2020-04-18 19:56:12.211879"], ["id", 7]]
---
  def edit
    @student = Student.find(params[:id])
    @student.update(first_name: params[:first_name], last_name: params[:last_name])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Bob"], ["last_name", "Mendocino"], ["updated_at", "2020-04-18 19:45:30.323751"], ["id", 7]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(params.require(:student).permit(:first_name, :last_name))